In [1]:
import pandas as pd

## Series

In [6]:
data = [1,2,3,4,5]
s = pd.Series(data)

In [7]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
index = ['Linha' + str(i) for i in range(5)]

In [10]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [15]:
s = pd.Series(data,index) # (data,index) == (data=data,index=index)

In [16]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [17]:
data = {"Linha"+str(i): i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [19]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [24]:
s1 = s + 2

In [25]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [26]:
s2 = s + s1

In [27]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## Data Frame

In [28]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [29]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [32]:
df1 = pd.DataFrame(data=data)

In [33]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [36]:
index = ["Linha" + str(i) for i in range(3)]

In [37]:
index

['Linha0', 'Linha1', 'Linha2']

In [38]:
df1 = pd.DataFrame(data=data, index=index)

In [39]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [41]:
columns = ["Coluna" + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [42]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)

In [43]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [44]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [45]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [47]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [50]:
data = [(1,2,3),
        (4,5,6),
        (7,8,9)]

In [51]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [52]:
df3 = pd.DataFrame(data=data, index=index, columns=columns)

In [53]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [55]:
df1[df1 > 0] = "A"
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [56]:
df2[df2 > 0] = "B"
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [57]:
df3[df3 > 0] = "C"
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [58]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [59]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

## Exercícios

In [61]:
#In [4]:

df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])
#Out [4]:

#A	B	C	D
#X	1	2	3	4

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [62]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D